       IDENTIFICATION DIVISION.                                                 
       PROGRAM-ID. DCJA6PGU.                                                    
       AUTHOR. KODY BEATTIE.                                                    
                                                                                
       ENVIRONMENT DIVISION.                                                    
       CONFIGURATION SECTION.                                                   
       DATA DIVISION.                                                           
       WORKING-STORAGE SECTION.                                                 
                                                                                
      * COPY INQUIRY MAP LAYOUT                                                 
       COPY 'DCJA6MC'.                                                          
       COPY 'CHECK'.                                                            
      * COPY ACCTFILE RECORD LAYOUT                                             
       COPY 'STUREC'.                                                           
       01 WS-COMMAREA      PIC X VALUE 'X'.                                     
       01 WS-COMMAREA-LEN  PIC S9(4) COMP VALUE 1.                              
      * VARIABLES FOR PASSING DATA BETWEEN RUNS OF THIS PROGRAM                 
       01 WS-SAVE-DATA.                                                         
           05 WS-MODE        PIC X                                              
                VALUE 'I'.                                                      
           05 WS-STUCOURSE1  PIC X(8).                                          
           05 WS-STUCOURSE2  PIC X(8).                                          
           05 WS-STUCOURSE3  PIC X(8).                                          
           05 WS-STUCOURSE4  PIC X(8).                                          
           05 WS-STUCOURSE5  PIC X(8).                                          
           05 WS-STUNAME     PIC X(20).                                         
           05 WS-ADDLINE1    PIC X(20).                                         
           05 WS-ADDLINE2    PIC X(20).                                         
           05 WS-ADDLINE3    PIC X(20).                                         
           05 WS-POST1       PIC X(3).                                          
           05 WS-POST2       PIC X(3).                                          
           05 WS-PHONE1      PIC X(3).                                          
           05 WS-PHONE2      PIC X(3).                                          
           05 WS-PHONE3      PIC X(4).                                          
           05 FILLER         PIC X(4)                                           
                VALUE SPACES.                                                   
                                                                                
       01 WS-SAVE-DATA-LEN   PIC S9(4) COMP                                     
           VALUE 140.                                                           
       01 WS-TRAN-COMM-LEN   PIC S9(4) COMP VALUE 7.                            
      * THE BELOW FILLER VARIABLE MUST BE PRESENT BETWEEN DFHBMSCA              
      * AND ALL OTHER VARIABLES                                                 
       01 FILLER             PIC X(1024)                                        
           VALUE SPACES.                                                        
                                                                                
       COPY DFHBMSCA.                                                           
                                                                                
       LINKAGE SECTION.                                                         
                                                                                
       01 DFHCOMMAREA PIC X(207).                                               
                                                                                
       PROCEDURE DIVISION.                                                      
       000-START-LOGIC.                                                         
           IF (EIBCALEN = 1) THEN                                               
                GO TO 100-FIRST-TIME                                            
           END-IF.                                                              
           IF (EIBCALEN = 7) THEN                                               
                GO TO 225-TRANSFER-INQUIRY                                      
           END-IF.                                                              
                                                                                
                                                                                
           EXEC CICS HANDLE CONDITION                                           
               MAPFAIL(100-FIRST-TIME)                                          
               NOTFND(300-NOTFND)                                               
           END-EXEC.                                                            
           EXEC CICS HANDLE AID                                                 
               PF4(100-FIRST-TIME)                                              
               PF9(999-EXIT)                                                    
           END-EXEC.                                                            
                                                                                
      * ATTEMPT TO RECEIVE MAP FROM TERMINAL                                    
           EXEC CICS RECEIVE                                                    
                MAP('MAP1')                                                     
                MAPSET('DCJA6MC')                                               
           END-EXEC.                                                            
                                                                                
      * RECEIVE WAS SUCCESSFUL, PROCEED WITH MAIN PROCESSING                    
           GO TO 200-MAIN-LOGIC.                                                
                                                                                
       100-FIRST-TIME.                                                          
                                                                                
           PERFORM 400-PREP-INQUIRY.                                            
                                                                                
           EXEC CICS SEND                                                       
               MAP('MAP1')                                                      
               MAPSET('DCJA6MC')                                                
               ERASE                                                            
           END-EXEC.                                                            
                                                                                
           EXEC CICS RETURN                                                     
               TRANSID('JA63')                                                  
               COMMAREA(WS-SAVE-DATA)                                           
               LENGTH(WS-SAVE-DATA-LEN)                                         
           END-EXEC.                                                            
                                                                                
       200-MAIN-LOGIC.                                                          
                                                                                
           MOVE DFHCOMMAREA TO WS-SAVE-DATA.                                    
                                                                                
           IF (WS-MODE = "I") THEN                                              
               GO TO 225-INQUIRY                                                
           ELSE IF (WS-MODE = "U")                                              
               GO TO 250-UPDATE                                                 
           ELSE                                                                 
                                                                                
               MOVE LOW-VALUES TO MAP1O                                         
               MOVE "NOTHING HAPPENED. INQUIRING?" TO MSGO                      
                                                                                
                                                                                
      * MOVE VALUES FROM STUREC TO O FIELDS                                     
                                                                                
               EXEC CICS SEND                                                   
                    MAP('MAP1')                                                 
                    MAPSET('DCJA6MC')                                           
               END-EXEC                                                         
                                                                                
               EXEC CICS RETURN                                                 
                    TRANSID('JA63')                                             
                    COMMAREA(WS-SAVE-DATA)                                      
                    LENGTH(WS-SAVE-DATA-LEN)                                    
               END-EXEC                                                         
           END-IF.                                                              
                                                                                
       225-TRANSFER-INQUIRY.                                                    
           MOVE LOW-VALUES TO MAP1O.                                            
           EXEC CICS SEND                                                       
               MAP('MAP1')                                                      
               MAPSET('DCJA6MC')                                                
               ERASE                                                            
                                                                                
                                                                                
           END-EXEC.                                                            
           MOVE DFHCOMMAREA(1:7) TO STU-NUMBER.                                 
           IF(STU-NUMBER = 'XXXXXXX')                                           
               GO TO 999-EXIT                                                   
           END-IF.                                                              
           GO TO 299-POPULATE-INQUIRY-FIELDS.                                   
                                                                                
                                                                                
       225-INQUIRY.                                                             
           MOVE LOW-VALUES TO DFHCOMMAREA.                                      
           IF(STUNUMI = 'XXXXXXX') THEN                                         
               GO TO 999-EXIT                                                   
           END-IF.                                                              
           IF STUNUML < 7 THEN                                                  
               GO TO 700-STU-NUM-TO-SHORT                                       
           END-IF.                                                              
           IF STUNUMI IS NOT NUMERIC THEN                                       
               GO TO 800-STU-NUM-NOT-NUMERIC                                    
           END-IF.                                                              
           MOVE STUNUMI TO STU-NUMBER.                                          
           GO TO 299-POPULATE-INQUIRY-FIELDS.                                   
                                                                                
       250-UPDATE.                                                              
                                                                                
      * CHECK IF USER HAS DATA ON SCREEN                                        
               IF (COURSE1I IS EQUAL TO WS-STUCOURSE1                           
                   AND COURSE2I IS EQUAL TO WS-STUCOURSE2                       
                   AND COURSE3I IS EQUAL TO WS-STUCOURSE3                       
                   AND COURSE4I IS EQUAL TO WS-STUCOURSE4                       
                   AND COURSE5I IS EQUAL TO WS-STUCOURSE5                       
                   AND STUNAMEI IS EQUAL TO WS-STUNAME                          
                   AND ADDLINE1I IS EQUAL TO WS-ADDLINE1                        
                   AND ADDLINE2I IS EQUAL TO WS-ADDLINE2                        
                   AND ADDLINE3I IS EQUAL TO WS-ADDLINE3                        
                                                                                
                   AND POST1I IS EQUAL TO WS-POST1                              
                   AND POST2I IS EQUAL TO WS-POST2                              
                   AND PHONE1I IS EQUAL TO WS-PHONE1                            
                   AND PHONE2I IS EQUAL TO WS-PHONE2                            
                   AND PHONE3I IS EQUAL TO WS-PHONE3) THEN                      
                   PERFORM 400-PREP-INQUIRY                                     
                   MOVE 'NOTHING CHANGED. NEW INQUIRY?' TO MSGO                 
                   EXEC CICS SEND                                               
                        MAP('MAP1')                                             
                        MAPSET('DCJA6MC')                                       
                        ERASE                                                   
                   END-EXEC                                                     
                                                                                
                   EXEC CICS RETURN                                             
                        TRANSID('JA63')                                         
                                                                                
                        COMMAREA(WS-SAVE-DATA)                                  
                        LENGTH(WS-SAVE-DATA-LEN)                                
                   END-EXEC                                                     
               ELSE                                                             
                   MOVE STUNUMI TO CHK-NUMBER                                   
                   MOVE STUNAMEI TO CHK-NAME                                    
                   MOVE COURSE1I TO CHK-COURSE-1                                
                   MOVE COURSE2I TO CHK-COURSE-2                                
                   MOVE COURSE3I TO CHK-COURSE-3                                
                   MOVE COURSE4I TO CHK-COURSE-4                                
                   MOVE COURSE5I TO CHK-COURSE-5                                
                   MOVE ADDLINE1I TO CHK-ADDRESS-1                              
                   MOVE ADDLINE2I TO CHK-ADDRESS-2                              
                   MOVE ADDLINE3I TO CHK-ADDRESS-3                              
                   MOVE POST1I TO CHK-POSTAL-1                                  
                   MOVE POST2I TO CHK-POSTAL-2                                  
                   MOVE PHONE1I TO CHK-PHONE-1                                  
                   MOVE PHONE2I TO CHK-PHONE-2                                  
                   MOVE PHONE3I TO CHK-PHONE-3                                  
                   MOVE STUNUML TO CHK-NUMBERL                                  
                   MOVE STUNAMEL TO CHK-NAMEL                                   
                   MOVE COURSE1L TO CHK-COURSE-1L                               
                   MOVE COURSE2L TO CHK-COURSE-2L                               
                   MOVE COURSE3L TO CHK-COURSE-3L                               
                   MOVE COURSE4L TO CHK-COURSE-4L                               
                   MOVE COURSE5L TO CHK-COURSE-5L                               
                   MOVE ADDLINE1L TO CHK-ADDRESS-1L                             
                   MOVE ADDLINE2L TO CHK-ADDRESS-2L                             
                   MOVE POST1L TO CHK-POSTAL-1L                                 
                   MOVE POST2L TO CHK-POSTAL-2L                                 
                   MOVE PHONE1L TO CHK-PHONE-1L                                 
                   MOVE PHONE2L TO CHK-PHONE-2L                                 
                   MOVE PHONE3L TO CHK-PHONE-3L                                 
                                                                                
                                                                                
                  EXEC CICS LINK                                                
                      PROGRAM('DCJA6PGE')                                       
                      COMMAREA(CHECK-RECORD)                                    
                  END-EXEC                                                      
                  IF (ERR-FIELD NOT EQUAL 0) THEN                               
                      GO TO 500-ERROR-RETURN                                    
                                                                                
                  ELSE                                                          
                      MOVE STUNUMI TO STU-NUMBER                                
                      EXEC CICS READ                                            
                          FILE('STUFILE')                                       
                          RIDFLD(STU-KEY)                                       
                          INTO (STUFILE-RECORD)                                 
                          UPDATE                                                
                      END-EXEC                                                  
                      MOVE STUNAMEI TO STU-NAME                                 
                      MOVE COURSE1I TO STU-COURSE-1                             
                      MOVE COURSE2I TO STU-COURSE-2                             
                      MOVE COURSE3I TO STU-COURSE-3                             
                      MOVE COURSE4I TO STU-COURSE-4                             
                      MOVE COURSE5I TO STU-COURSE-5                             
                      MOVE ADDLINE1I TO STU-ADDRESS-1                           
                      MOVE ADDLINE2I TO STU-ADDRESS-2                           
                      MOVE ADDLINE3I TO STU-ADDRESS-3                           
                      MOVE POST1I TO STU-POSTAL-1                               
                      MOVE POST2I TO STU-POSTAL-2                               
                      MOVE PHONE1I TO STU-PHONE-1                               
                      MOVE PHONE2I TO STU-PHONE-2                               
                      MOVE PHONE3I TO STU-PHONE-3                               
                      EXEC CICS REWRITE                                         
                          FILE('STUFILE')                                       
                          FROM(STUFILE-RECORD)                                  
                          LENGTH(STUFILE-LENGTH)                                
                      END-EXEC                                                  
                                                                                
                      PERFORM 400-PREP-INQUIRY                                  
                      MOVE "RECORD UPDATED. NEW INQUIRY?" TO MSGO               
                      EXEC CICS SEND                                            
                          MAP('MAP1')                                           
                          MAPSET('DCJA6MC')                                     
                          ERASE                                                 
                      END-EXEC                                                  
                                                                                
                      EXEC CICS RETURN                                          
                          TRANSID('JA63')                                       
                          COMMAREA(WS-SAVE-DATA)                                
                          LENGTH(WS-SAVE-DATA-LEN)                              
                      END-EXEC                                                  
                  END-IF                                                        
               END-IF.                                                          
                                                                                
       299-POPULATE-INQUIRY-FIELDS.                                             
           EXEC CICS READ                                                       
               FILE('STUFILE')                                                  
               INTO(STUFILE-RECORD)                                             
               RIDFLD(STU-KEY)                                                  
           END-EXEC.                                                            
           PERFORM 450-PREP-UPDATE.                                             
           MOVE STU-NUMBER TO STUNUMO.                                          
           MOVE STU-NAME TO STUNAMEO WS-STUNAME.                                
           MOVE STU-COURSE-1 TO COURSE1O WS-STUCOURSE1.                         
           MOVE STU-COURSE-2 TO COURSE2O WS-STUCOURSE2.                         
           MOVE STU-COURSE-3 TO COURSE3O WS-STUCOURSE3.                         
           MOVE STU-COURSE-4 TO COURSE4O WS-STUCOURSE4.                         
           MOVE STU-COURSE-5 TO COURSE5O WS-STUCOURSE5.                         
           MOVE STU-ADDRESS-1 TO ADDLINE1O WS-ADDLINE1.                         
           MOVE STU-ADDRESS-2 TO ADDLINE2O WS-ADDLINE2.                         
           MOVE STU-ADDRESS-3 TO ADDLINE3O WS-ADDLINE3.                         
           MOVE STU-POSTAL-1 TO POST1O WS-POST1.                                
           MOVE STU-POSTAL-2 TO POST2O WS-POST2.                                
           MOVE STU-PHONE-1 TO PHONE1O WS-PHONE1.                               
           MOVE STU-PHONE-2 TO PHONE2O WS-PHONE2.                               
           MOVE STU-PHONE-3 TO PHONE3O WS-PHONE3.                               
           MOVE "STUDENT FOUND" TO MSGO.                                        
                                                                                
                                                                                
           EXEC CICS SEND                                                       
               MAP('MAP1')                                                      
               MAPSET('DCJA6MC')                                                
                                                                                
               CURSOR                                                           
                                                                                
           END-EXEC.                                                            
                                                                                
                                                                                
           EXEC CICS RETURN                                                     
               TRANSID('JA63')                                                  
               COMMAREA(WS-SAVE-DATA)                                           
               LENGTH(WS-SAVE-DATA-LEN)                                         
           END-EXEC.                                                            
                                                                                
       300-NOTFND.                                                              
                                                                                
           MOVE LOW-VALUES TO MAP1O.                                            
           PERFORM 400-PREP-INQUIRY.                                            
           MOVE 'STUDENT NOT FOUND. RETRY INQUIRY?' TO MSGO.                    
                                                                                
           EXEC CICS SEND                                                       
                MAP('MAP1')                                                     
                MAPSET('DCJA6MC')                                               
           END-EXEC.                                                            
                                                                                
           EXEC CICS RETURN                                                     
                TRANSID('JA63')                                                 
                COMMAREA(WS-SAVE-DATA)                                          
                LENGTH(WS-SAVE-DATA-LEN)                                        
           END-EXEC.                                                            
                                                                                
       400-PREP-INQUIRY.                                                        
           MOVE LOW-VALUES TO MAP1O.                                            
           MOVE 'I N Q U I R Y    S C R E E N' TO TITLEO.                       
           MOVE DFHBMASF TO COURSE1A COURSE2A COURSE3A COURSE4A COURSE5A        
               STUNAMEA ADDLINE1A ADDLINE2A ADDLINE3A POST1A POST2A             
               PHONE1A PHONE2A PHONE3A.                                         
           MOVE "I" TO WS-MODE.                                                 
                                                                                
       450-PREP-UPDATE.                                                         
           MOVE LOW-VALUES TO MAP1O.                                            
           MOVE "U P D A T E      S C R E E N" TO TITLEO.                       
           MOVE DFHBMASF TO STUNUMA.                                            
           MOVE -1 TO COURSE1L.                                                 
           MOVE "U" TO WS-MODE.                                                 
                                                                                
       500-ERROR-RETURN.                                                        
           MOVE LOW-VALUES TO MAP1O.                                            
           MOVE "U P D A T E      S C R E E N" TO TITLEO.                       
           MOVE DFHBMASF TO STUNUMA.                                            
           PERFORM 600-MOVE-CURSOR.                                             
           MOVE ERR-MSG TO MSGO.                                                
           EXEC CICS SEND                                                       
               MAP('MAP1')                                                      
               MAPSET('DCJA6MC')                                                
               CURSOR                                                           
           END-EXEC.                                                            
           EXEC CICS RETURN                                                     
               TRANSID('JA63')                                                  
               COMMAREA(WS-SAVE-DATA)                                           
               LENGTH(WS-SAVE-DATA-LEN)                                         
           END-EXEC.                                                            
                                                                                
       600-MOVE-CURSOR.                                                         
                                                                                
           IF ERR-FIELD EQUAL 02 THEN                                           
               MOVE -1 TO COURSE1L                                              
           END-IF.                                                              
           IF ERR-FIELD EQUAL 03 THEN                                           
               MOVE -1 TO COURSE2L                                              
           END-IF.                                                              
           IF ERR-FIELD EQUAL 04 THEN                                           
               MOVE -1 TO COURSE3L                                              
           END-IF.                                                              
           IF ERR-FIELD EQUAL 05 THEN                                           
               MOVE -1 TO COURSE4L                                              
           END-IF.                                                              
           IF ERR-FIELD EQUAL 06 THEN                                           
               MOVE -1 TO COURSE5L                                              
           END-IF.                                                              
           IF ERR-FIELD EQUAL 07 THEN                                           
               MOVE -1 TO STUNAMEL                                              
           END-IF.                                                              
           IF ERR-FIELD EQUAL 08 THEN                                           
               MOVE -1 TO ADDLINE1L                                             
           END-IF.                                                              
           IF ERR-FIELD EQUAL 09 THEN                                           
               MOVE -1 TO ADDLINE2L                                             
           END-IF.                                                              
           IF ERR-FIELD EQUAL 10 THEN                                           
               MOVE -1 TO ADDLINE3L                                             
           END-IF.                                                              
           IF ERR-FIELD EQUAL 11 THEN                                           
               MOVE -1 TO POST1L                                                
           END-IF.                                                              
           IF ERR-FIELD EQUAL 12 THEN                                           
               MOVE -1 TO POST2L                                                
           END-IF.                                                              
           IF ERR-FIELD EQUAL 13 THEN                                           
               MOVE -1 TO PHONE1L                                               
           END-IF.                                                              
           IF ERR-FIELD EQUAL 14 THEN                                           
               MOVE -1 TO PHONE2L                                               
           END-IF.                                                              
           IF ERR-FIELD EQUAL 15 THEN                                           
               MOVE -1 TO PHONE3L                                               
           END-IF.                                                              
                                                                                
       700-STU-NUM-TO-SHORT.                                                    
           PERFORM 400-PREP-INQUIRY.                                            
                                                                                
           MOVE 'STUDENT NUMBER MUST BE 7 INTEGERS LONG. RE-ENTER'              
               TO MSGO.                                                         
                                                                                
           EXEC CICS SEND MAP('MAP1') MAPSET('DCJA6MC') ERASE END-EXEC.         
           EXEC CICS RETURN                                                     
                TRANSID('JA63')                                                 
                COMMAREA(WS-SAVE-DATA)                                          
                LENGTH(WS-SAVE-DATA-LEN)                                        
           END-EXEC.                                                            
                                                                                
       800-STU-NUM-NOT-NUMERIC.                                                 
           PERFORM 400-PREP-INQUIRY.                                            
                                                                                
           MOVE 'STUDENT NUMBER MUST BE NUMERIC. RE-ENTER' TO MSGO.             
                                                                                
           EXEC CICS SEND MAP('MAP1') MAPSET('DCJA6MC') ERASE END-EXEC.         
           EXEC CICS RETURN                                                     
                TRANSID('JA63')                                                 
                COMMAREA(WS-SAVE-DATA)                                          
                LENGTH(WS-SAVE-DATA-LEN)                                        
           END-EXEC.                                                            
                                                                                
       999-EXIT.                                                                
           EXEC CICS XCTL                                                       
                PROGRAM('DCJA6PGM')                                             
                COMMAREA(WS-COMMAREA)                                           
                LENGTH(WS-COMMAREA-LEN)                                         
           END-EXEC.                                                            
                                                                                
                                                                                
                                                                                
       END PROGRAM DCJA6PGU.                                                    
                                                                                
